{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "metadata": {
    "_generator": {
      "name": "AzOps"
    }
  },
  "parameters": {},
  "variables": {},
  "resources": [
    {
      "apiVersion": "2020-08-01",
      "name": "test55-law/Security(test55-law)_SecurityWarningNotableIssues|LogonsWithClearTextPassword",
      "properties": {
        "category": "Security Warning Notable Issues",
        "displayName": "Logons with a clear text password",
        "query": "SecurityEvent | where EventID == 4624 and LogonType == 8 | summarize count() by TargetAccount",
        "version": 2
      },
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches"
    }
  ],
  "outputs": {}
}
