{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "metadata": {
    "_generator": {
      "name": "AzOps"
    }
  },
  "parameters": {},
  "variables": {},
  "resources": [
    {
      "apiVersion": "2020-08-01",
      "name": "test34-law/Security(test34-law)_SecurityWarningNotableIssues|SuspiciousExecutables",
      "properties": {
        "category": "Security Warning Notable Issues",
        "displayName": "Suspicious executables",
        "query": "SecurityEvent | where EventID == 8002 and Fqbn == '-' | summarize ExecutionCountHash=count() by FileHash | where ExecutionCountHash <= 5",
        "version": 2
      },
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches"
    }
  ],
  "outputs": {}
}
