{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "metadata": {
    "_generator": {
      "name": "AzOps"
    }
  },
  "parameters": {},
  "variables": {},
  "resources": [
    {
      "apiVersion": "2020-08-01",
      "name": "north-star-law/Security(north-star-law)_SecurityWarningNotableIssues|DomainSecurityPolicyChanges",
      "properties": {
        "category": "Security Warning Notable Issues",
        "displayName": "Domain security policy changes",
        "query": "SecurityEvent | where EventID == 4739 | summarize count() by DomainPolicyChanged",
        "version": 2
      },
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches"
    }
  ],
  "outputs": {}
}
